# ---------- Core shell / UX ----------
brew "direnv"
brew "fzf"
brew "fzf-tab"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "watch"
brew "telnet"

# ---------- Secrets / env ----------
brew "bitwarden-cli"
brew "teller"

# ---------- Kubernetes / Cloud ----------
brew "helm"
brew "k9s"
brew "kind"
brew "minikube"

# ---------- Infra / DevOps ----------
brew "terraform"

# ---------- Data / Parsing ----------
brew "yq"
brew "libpq"
brew "jq"

# ---------- Spectral ----------
brew "spectralops/tap/keyscope"



# ---------- Terminal / UI ----------
cask "iterm2"
cask "font-jetbrains-mono-nerd-font"

# ---------- Containers / Infra ----------
cask "docker"

# ---------- Editors ----------
cask "cursor"

# ---------- Browsers (dev-friendly) ----------
cask "google-chrome"
# cask "firefox"        # optional

# ---------- Kubernetes UI ----------
# (k9s is CLI; no GUI needed here)

# ---------- AI ----------
brew "claude"

# ---------- Utilities ----------

